<a href="https://colab.research.google.com/github/Coolicc/Big-Data-Analysis-PySpark/blob/main/Copy_of_1_cas_zadatak.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
from google.colab import drive
drive.mount('/content/drive')

Go to this URL in a browser: https://accounts.google.com/o/oauth2/auth?client_id=947318989803-6bn6qk8qdgf4n4g3pfee6491hc0brc4i.apps.googleusercontent.com&redirect_uri=urn%3aietf%3awg%3aoauth%3a2.0%3aoob&response_type=code&scope=email%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdocs.test%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdrive%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdrive.photos.readonly%20https%3a%2f%2fwww.googleapis.com%2fauth%2fpeopleapi.readonly

Enter your authorization code:
··········
Mounted at /content/drive

Učitati dataset sa adrese https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user

In [ ]:
import pandas as pd
df = pd.read_csv("https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user", "|")
df

     user_id  age gender     occupation zip_code
0          1   24      M     technician    85711
1          2   53      F          other    94043
2          3   23      M         writer    32067
3          4   24      M     technician    43537
4          5   33      F          other    15213
..       ...  ...    ...            ...      ...
938      939   26      F        student    33319
939      940   32      M  administrator    02215
940      941   20      M        student    97229
941      942   48      F      librarian    78209
942      943   22      M        student    77841

[943 rows x 5 columns]

Prikazati prvih 15 vrsta u data *setu*

In [ ]:
df.head(15)

    user_id  age gender     occupation zip_code
0         1   24      M     technician    85711
1         2   53      F          other    94043
2         3   23      M         writer    32067
3         4   24      M     technician    43537
4         5   33      F          other    15213
5         6   42      M      executive    98101
6         7   57      M  administrator    91344
7         8   36      M  administrator    05201
8         9   29      M        student    01002
9        10   53      M         lawyer    90703
10       11   39      F          other    30329
11       12   28      F          other    06405
12       13   47      M       educator    29206
13       14   45      M      scientist    55106
14       15   49      F       educator    97301

Prikazati poslednjih 10 vrsta

In [ ]:
df.tail(10)

     user_id  age gender     occupation zip_code
933      934   61      M       engineer    22902
934      935   42      M         doctor    66221
935      936   24      M          other    32789
936      937   48      M       educator    98072
937      938   38      F     technician    55038
938      939   26      F        student    33319
939      940   32      M  administrator    02215
940      941   20      M        student    97229
941      942   48      F      librarian    78209
942      943   22      M        student    77841

Koliko ima vrsti u data setu?

In [ ]:
df.shape

(943, 5)

Postaviti da indeks bude kolona user_id

In [ ]:
df = df.set_index("user_id")
df.index

Int64Index([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,
            ...
            934, 935, 936, 937, 938, 939, 940, 941, 942, 943],
           dtype='int64', name='user_id', length=943)

Kog tipa su vrednosti u kolonama?

In [ ]:
df.dtypes

age            int64
gender        object
occupation    object
zip_code      object
dtype: object

Prikazati nazive kolona

In [ ]:
df.columns

Index(['age', 'gender', 'occupation', 'zip_code'], dtype='object')

Prikazati samo kolonu occupation

In [ ]:
df.occupation

user_id
1         technician
2              other
3             writer
4         technician
5              other
           ...
939          student
940    administrator
941          student
942        librarian
943          student
Name: occupation, Length: 943, dtype: object

Koliko različitih zanimanja postoji u datasetu

In [ ]:
print(df.occupation.drop_duplicates())
df.occupation.drop_duplicates().size

user_id
1         technician
2              other
3             writer
6          executive
7      administrator
9            student
10            lawyer
13          educator
14         scientist
16     entertainment
17        programmer
19         librarian
20         homemaker
23            artist
25          engineer
46         marketing
57              none
60        healthcare
106          retired
112         salesman
138           doctor
Name: occupation, dtype: object

21

Za svako zanimanje ispisati broj pojavljivanja

In [ ]:
df.occupation.value_counts()

student          196
other            105
educator          95
administrator     79
engineer          67
programmer        66
librarian         51
writer            45
executive         32
scientist         31
artist            28
technician        27
marketing         26
entertainment     18
healthcare        16
retired           14
lawyer            12
salesman          12
none               9
doctor             7
homemaker          7
Name: occupation, dtype: int64

Koja je prosečna starost korisnika?

In [ ]:
print("avg: " + str(df.age.mean()))
print("min: " + str(df.age.min()))
print("max: " + str(df.age.max()))
print("std: " + str(df.age.std()))
print("oldest person")
print(str(df[df.age == df.age.max()]))

avg: 34.05196182396607
min: 7
max: 73
std: 12.192739733059044
oldest person
         age gender occupation zip_code
user_id
481       73      M    retired    37771

Prikazati ona godišta koja se pojavljuju minimalno

In [ ]:
s = df.age.value_counts()
res = s[s == s.min()]
print(res)
df.join(res, on = "age", rsuffix = "_frequency", how = "inner")

11    1
10    1
73    1
66    1
7     1
Name: age, dtype: int64

         age gender occupation zip_code  age_frequency
user_id
30         7      M    student    55436              1
211       66      M   salesman    32605              1
289       11      M       none    94619              1
471       10      M    student    77459              1
481       73      M    retired    37771              1

Kolika je prosečna starost osobe prema zanimanju

In [ ]:
df.groupby("occupation").age.mean().round(2)

occupation
administrator    38.75
artist           31.39
doctor           43.57
educator         42.01
engineer         36.39
entertainment    29.22
executive        38.72
healthcare       41.56
homemaker        32.57
lawyer           36.75
librarian        40.00
marketing        37.62
none             26.56
other            34.52
programmer       33.12
retired          63.07
salesman         35.67
scientist        35.55
student          22.08
technician       33.15
writer           36.31
Name: age, dtype: float64

Koliko ima žena, a koliko muškaraca u svakom zanimanju?
Koliki je udeo muškaraca u svakom zanimanju?

In [ ]:
print(str(df.groupby(["occupation", "gender"]).occupation.count()))

occupation     gender
administrator  F          36
               M          43
artist         F          13
               M          15
doctor         M           7
educator       F          26
               M          69
engineer       F           2
               M          65
entertainment  F           2
               M          16
executive      F           3
               M          29
healthcare     F          11
               M           5
homemaker      F           6
               M           1
lawyer         F           2
               M          10
librarian      F          29
               M          22
marketing      F          10
               M          16
none           F           4
               M           5
other          F          36
               M          69
programmer     F           6
               M          60
retired        F           1
               M          13
salesman       F           3
               M           9
scientist      F           3
               M          28
student        F          60
               M         136
technician     F           1
               M          26
writer         F          19
               M          26
Name: occupation, dtype: int64

Za svako zanimanje ispisati minimalnu i maksimalnu starost

In [ ]:
min_ser = df.groupby("occupation").age.min()
min_occ_df = pd.DataFrame(min_ser)
min_occ_df.join(df.groupby("occupation").age.max(), on="occupation", lsuffix="_min", rsuffix="_max", how="inner")
### ili
df.groupby("occupation").age.agg(["min", "max"])

               min  max
occupation
administrator   21   70
artist          19   48
doctor          28   64
educator        23   63
engineer        22   70
entertainment   15   50
executive       22   69
healthcare      22   62
homemaker       20   50
lawyer          21   53
librarian       23   69
marketing       24   55
none            11   55
other           13   64
programmer      20   63
retired         51   73
salesman        18   66
scientist       23   55
student          7   42
technician      21   55
writer          18   60

Za svako zanimanje izračunati posebno prosečnu starost za žene a posebno za muškarce

In [ ]:
df.groupby(["occupation", "gender"]).age.mean()

occupation     gender
administrator  F         40.638889
               M         37.162791
artist         F         30.307692
               M         32.333333
doctor         M         43.571429
educator       F         39.115385
               M         43.101449
engineer       F         29.500000
               M         36.600000
entertainment  F         31.000000
               M         29.000000
executive      F         44.000000
               M         38.172414
healthcare     F         39.818182
               M         45.400000
homemaker      F         34.166667
               M         23.000000
lawyer         F         39.500000
               M         36.200000
librarian      F         40.000000
               M         40.000000
marketing      F         37.200000
               M         37.875000
none           F         36.500000
               M         18.600000
other          F         35.472222
               M         34.028986
programmer     F         32.166667
               M         33.216667
retired        F         70.000000
               M         62.538462
salesman       F         27.000000
               M         38.555556
scientist      F         28.333333
               M         36.321429
student        F         20.750000
               M         22.669118
technician     F         38.000000
               M         32.961538
writer         F         37.631579
               M         35.346154
Name: age, dtype: float64

Za svako zanimanje prikazati koliko je u procenata muškaraca a koliko žena

In [ ]:
df.groupby(["occupation", "gender"]).gender